Tekla Open API Reference for Tekla Structures 2025
ComponentOptions.AssemblyLoosePartPositionPrefix Property
The assembly loose position prefix.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string AssemblyLoosePartPositionPrefix { get; set; }
Public Property AssemblyLoosePartPositionPrefix As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ComponentOptions Class
Tekla.Structures Namespace